week5/planets-db/app/controllers/planets_controller.rb

INSERT INTO "planets" ("name", "image", "mass", "temperature", "moons", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Test"], ["image", ""], ["mass", 500.0], ["temperature", 12.0], ["moons", 6], ["created_at", "2018-05-15 05:57:26.126082"], ["updated_at", "2018-05-15 05:57:26.126082"]]
---
    def create
      Planet.create(
        name: params[:name],
        image: params[:image],
        orbit: params[:orbit],
        diameter: params[:diameter],
        mass: params[:mass],
        temperature: params[:temperature],
        moons: params[:moons]
      )

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def edit
      @planet = Planet.find params[:id] #id comes from the routes "/planets/:id/edit"

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "planets" SET "moons" = ?, "updated_at" = ? WHERE "planets"."id" = ?  [["moons", 122], ["updated_at", "2018-05-15 06:13:47.664642"], ["id", 8]]
---
    def update
     # edit form submits to here
     planet = Planet.find params[:id]
     planet.update(
       name: params[:name],
       image: params[:image],
       orbit: params[:orbit],
       diameter: params[:diameter],
       mass: params[:mass],
       moons: params[:moons],
       temperature: params[:temperature]
     )

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 6]]
---
    def destroy
      planet = Planet.find params[:id]
      planet.destroy