week8/secrets/secrets-server/app/controllers/secrets_controller.rb

  def index
    # secrets = Secret.all
    render json: Secret.all
---
SELECT "secrets".* FROM "secrets"

  def create
    secret = Secret.create content: params['content']
---
INSERT INTO "secrets" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "hello"], ["created_at", "2018-06-05 02:01:28.668592"], ["updated_at", "2018-06-05 02:01:28.668592"]]