week5/tunr/app/views/songs/_form.html.erb

SELECT "artists"."name", "artists"."id" FROM "artists"
---
  <%= f.label :artist_id, 'Artist' %>
  <%= f.select :artist_id, Artist.pluck(:name, :id), include_blank: true %>