week5/tunr/app/views/mixtapes/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
<br>
<% if @current_user.present? && @mixtape.user == @current_user %>