week7/ajax-dashboard/app/controllers/dashboard_controller.rb

SELECT "dogs".* FROM "dogs"
---
def dogs
  render json: Dog.all