week5/tunr/app/controllers/mixtapes_controller.rb

INSERT INTO "mixtapes" ("title", "image", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    # mixtape = Mixtape.create mixtape_params
    mixtape = Mixtape.new mixtape_params
    mixtape.user = @current_user # mixtape.user_id = @current_user.id
    mixtape.save

SELECT "mixtapes".* FROM "mixtapes"
---
  def index
    @mixtapes = Mixtape.all

UPDATE "mixtapes" SET "image" = $1, "updated_at" = $2 WHERE "mixtapes"."id" = $3
---
  def update
    @mixtape.update mixtape_params

DELETE FROM "mixtapes" WHERE "mixtapes"."id" = $1  [["id", 18]]
---
  def destroy
    # thanks to before_action,two things are done before this method is called:
    # get_mixtape (which sets @mixtape)
    # check_is_owner (which makes sure @current_user.id == @mixtape.user_id)
    @mixtape.destroy

SELECT  "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
  def get_mixtape
    @mixtape = Mixtape.find params[:id]