week5/tunr/app/controllers/session_controller.rb

  def create
    # raise "egg"
    user = User.find_by email: params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hekk@gmail"], ["LIMIT", 1]]