week5/tunr/app/controllers/songs_controller.rb

  def show
    @song = Song.find params[:id]
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 78], ["LIMIT", 1]]

  def edit
    @song = Song.find params[:id]
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 78], ["LIMIT", 1]]