week5/tunr/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "username", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.create user_params

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def show
    @user = User.find params[:id] # ie /users/17