week10/fruitstore-tdd/app/controllers/fruits_controller.rb

SELECT "fruits".* FROM "fruits"
---
  def index
    @fruits = Fruit.all.reverse

INSERT INTO "fruits" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2018-06-21 00:47:28.904079"], ["updated_at", "2018-06-21 00:47:28.904079"], ["name", "Strawberry"]]
---
  def create
    fruit = Fruit.create fruit_params