week5/moma-app/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "nationality", "period", "image", "roundness", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Ruby"], ["nationality", ""], ["period", ""], ["image", ""], ["roundness", ""], ["created_at", "2018-05-16 02:45:53.096771"], ["updated_at", "2018-05-16 02:45:53.096771"]]
---
  def create
   artist = Artist.create artist_params

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "artists" SET "roundness" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["roundness", "Also very round bear"], ["updated_at", "2018-05-16 05:15:06.802726"], ["id", 10]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def update
    artist = Artist.find params[:id]
    artist.update artist_params

    if artist.errors.any?

DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 8]]
---
  def destroy
    Artist.destroy params[:id] #artist = Artist.find params[:id]